    package com.company;

    import java.io.IOException;

    /*
        Раціональний (нескоротний) дріб представляється парою цілих чисел (a, b), де поля:
         a – чисельник,
         b – знаменник.
        Створити клас Rational для роботи з раціональними дробами. Обов’язково мають
        бути реалізовані наступні методи:
        Унарна операція (аргументом є даний об’єкт):
         обчислення значення value(), a / b;

        Бінарні операції (перший аргумент – даний об’єкт, другий аргумент – об’єкт-параметр):
                 додавання add(), (a1, b1) + (a2, b2) = (a1·b2 + a2·b1, b1·b2);
                 віднімання sub(), (a1, b1) – (a2, b2) = (a1·b2 – a2·b1, b1·b2);
                 множення mul(), (a1, b1)  (a2, b2) = (a1·a2, b1·b2).
                * має бути реалізована приватна функція скорочення дробу Reduce(), яка обов’язково
                викликається при виконанні арифметичних операцій.
                Виконати завдання свого варіанту Лабораторної роботи № 1.3. «Об’єкти – параметри
                методів (дії над кількома об’єктами)» як незалежні класи з конструкторами і
                перевантаженням операцій.
                Для демонстрації роботи з об’єктами нового типу у всіх завданнях потрібно написати
                головну функцію. У програмі обов’язково мають бути продемонстровані різні способи
                створення об’єктів і масивів об’єктів – різними конструкторами. */
    public class Main {

        public static void main(String[] args) throws IOException {
        Rational rational1 = new Rational();

            System.out.println("*Перший дріб.");
        rational1.inputA();
        rational1.inputB();

        /*Rational rationalX1 = new Rational(12, 25);
        Rational rationalY1 = new Rational(rationalX1);*/

        rational1.value(rational1);

            System.out.println("------------------------------------------------------");

        Rational rational2 = new Rational();

            System.out.println("*Другий дріб.");
        rational2.inputA();
        rational2.inputB();

        rational1.mul(rational1, rational2);
        }
    }


